In [1]:
import pandas as pd
a = pd.read_excel('Data.xlsx')
a
import numpy as np

In [8]:
d2 = a[[ 'DATE','DAY','TOTAL','WEEK NUMBER']]
d2

           DATE      DAY  TOTAL WEEK NUMBER
0    2020-06-19   FRIDAY     22      WEEK 1
1    2020-06-19   FRIDAY     10      WEEK 1
2    2020-06-19   FRIDAY     14      WEEK 1
3    2020-06-19   FRIDAY     18      WEEK 1
4    2020-06-19   FRIDAY     10      WEEK 1
...         ...      ...    ...         ...
1492 2020-07-21  TUESDAY     14      WEEK 5
1493 2020-07-21  TUESDAY     18      WEEK 5
1494 2020-07-21  TUESDAY     21      WEEK 5
1495 2020-07-21  TUESDAY     20      WEEK 5
1496 2020-07-21  TUESDAY     15      WEEK 5

[1497 rows x 4 columns]

In [39]:
b = d2.groupby('DATE')
c = b['DAY'].nunique()
c = c.to_frame()
c['DAY VALUE'] = ['FRIDAY','SATURDAY','SUNDAY','WEDNESDAY','THURSDAY','FRIDAY','SATURDAY','SUNDAY','MONDAY','WEDNESDAY','THURSDAY','FRIDAY','SATURDAY','SUNDAY','MONDAY','TUESDAY','WEDNESDAY','FRIDAY','SATURDAY','SUNDAY','MONDAY','TUESDAY','WEDNESDAY','FRIDAY','SATURDAY','SUNDAY','MONDAY','TUESDAY']
d = c['DAY VALUE'].value_counts()
d = d.to_frame()

In [42]:

d.index.names = ['DAY']
d

           DAY VALUE
DAY
SATURDAY           5
SUNDAY             5
FRIDAY             5
MONDAY             4
WEDNESDAY          4
TUESDAY            3
THURSDAY           2

In [3]:
group4 = d2.groupby('DAY')
d6 = group4['TOTAL'].agg([np.sum])
d6

            sum
DAY
FRIDAY     4731
MONDAY     2241
SATURDAY   3518
SUNDAY     3139
THURSDAY   1978
TUESDAY    3935
WEDNESDAY  2420

In [44]:
e = pd.merge(d6, d, on='DAY', how='outer')
e

            sum  Average day of week  DAY VALUE
DAY
THURSDAY   1978               494.50          2
MONDAY     2241               560.25          4
WEDNESDAY  2420               605.00          4
SUNDAY     3139               784.75          5
SATURDAY   3518               879.50          5
TUESDAY    3935               983.75          3
FRIDAY     4731              1182.75          5

In [45]:
e['Average day of week'] = e['sum']/e['DAY VALUE']

In [46]:
e

            sum  Average day of week  DAY VALUE
DAY
THURSDAY   1978           989.000000          2
MONDAY     2241           560.250000          4
WEDNESDAY  2420           605.000000          4
SUNDAY     3139           627.800000          5
SATURDAY   3518           703.600000          5
TUESDAY    3935          1311.666667          3
FRIDAY     4731           946.200000          5

In [49]:
e = e.sort_values('Average day of week', ascending = False)

In [50]:
e

            sum  Average day of week  DAY VALUE
DAY
TUESDAY    3935          1311.666667          3
THURSDAY   1978           989.000000          2
FRIDAY     4731           946.200000          5
SATURDAY   3518           703.600000          5
SUNDAY     3139           627.800000          5
WEDNESDAY  2420           605.000000          4
MONDAY     2241           560.250000          4

In [51]:
'''
Even though Tuesdays and Thursdays see a good business than other days of the week, 
the restaurant was closed on two Tuesdays and 3 Thursdays in the 5 weeks. 
So, it is suggested to change this, and to keep the restaurant closed on either 
Monday's or Wednesday's for Sanitization and Maintenance purpose. 
The average business of Tuesdays, Thursdays, Fridays and the weekends is 865$
The average business of Wednesdays and Mondays is 582$.
This action will add up the revenue by around 285$ every week, i.e. , 1140$ a month.
Business performance will improve by around 6%
'''

"\nEven though Tuesdays and Thursdays see a good business than other days of the week, \nthe restaurant was closed on two Tuesdays and 3 Thursdays in the 5 weeks. \nSo, it is suggested to change this, and to keep the restaurant closed on either \nMonday's or Wednesday's for Sanitization and Maintenance purpose. \nThe average business of Tuesdays, Thursdays, Fridays and the weekends is 865$\nThe average business of Wednesdays and Mondays is 582$.\nThis action will add up the revenue by around 285$ every week, i.e. , 1140$ a month.\nBusiness performance will improve by around 6%\n"